<?php
  list($n, $y) = explode(' ', fgets(STDIN));

  #合計金額がありえない場合-1と出力するため初期値は-1にする
  $money10000 = -1; //10000円の枚数
  $money5000 = -1; //5000円の枚数
  $money1000 = -1; //1000円の枚数
  
  for ($i = 0; $i <= $n; $i++) {
    for ($j = 0; $j + $i <= $n; $j++) { //$n枚以下の中で枚数を求めたいので$iと$jの総数と比べる必要がある
      $k = $n - $i - $j;  //1000円の枚数を求めるには全体の枚数から10000円と5000円の合計を引く
      $totalMoney = 10000 * $i + 5000 * $j + 1000 * $k;
      if ($y == $totalMoney) { //合計金額と一致した場合値の更新
        $money10000 = $i;
        $money5000  = $j;
        $money1000 = $k;
      }
    }
  }
  printf("%d %d %d", $money10000, $money5000, $money1000);
?>